app/controllers/proposal_viewer_controller.rb

  def show
        proposal = Proposal.find(params[:id])
---
SELECT * FROM "proposals" WHERE ("proposals".client_id = 1) LIMIT 1